"""
Гидрометцентр опубликовал списки средних дневных температур в Москве за май 2017 и 2018 годов. Определите какой год был более комфортный
 (т. е. в каком году было больше дней в мае с температурой от 22 до 26 градусов).
"""

may_2017 = [12, 15, 20, 17, 18, 23, 9, 9, 4, 14, 26, 27, 25, 22, 18]
may_2018 =[5, 5, 11, 7, 17, 11, 19, 18, 14, 20, 21, 24, 23, 25, 27]

count_2017 = 0
count_2018 = 0

for temp in may_2017:
    if 22 <= temp <= 26:
        count_2017 += 1

for temp in may_2018:
    if 22 <= temp <= 26:
        count_2018 += 1

if count_2017 > count_2018:
    print("2017")
elif count_2017 < count_2018:
    print("2018")
else:
    print("2017 и 2018")